Repository: FreezePeace1/UserWebApiTestTask
Catalog: UserWebApi.Application/Sources/ErrorMessages.*.resx
Languages: ru

source: Failed to create user
ru: Не удалось создать пользователя

source: User is not authorized or deleted
ru: Пользователь удален или не авторизован

source: Failed to update user
ru: Не удалось обновить пользователя

# NotSupportedCondition
source: Not supported condition to update user
ru: Не поддерживоемое условие на обновление пользователя

source: User already exists with this login
ru: Пользователь уже существует с данным логином

source: Enter needed dto values
ru: Введите нужные данные для DTO

source: Failed to find user
ru: Не удалось найти пользователя

source: User updating password is failed
ru: Обновление пароля пользователя неуспешно

source: Check your current password
ru: Проверьте свой пароль

source: Failed to update login of user
ru: Не удалось обновить логин пользователя

source: No access rights
ru: Нет прав доступа

source: Getting active users is failed
ru: Получение активных пользователей не удачно

source: Getting user personal data by login is failed
ru: Получение персональных данных пользователя провалено

# CheckYourCredentials
source: Check your cderentials
ru: Проверьте свой логин или пароль

source: Getting user by login and password is failed
ru: Получение пользователя по логину и паролю успешно

source: Getting all users by definite age is failed
ru: Получение всех пользователей по определенному возрасту неудачно

source: Failed to delete user
ru: Не удалось удалить пользователя

source: Recovering user by login is failed
ru: Восстановление пользователя по логину провалено

# UserInCookieAndAdminCheckingIsFailed
source: User in cookie and amdin checking is failed
ru: Проверка пользователя в куки и на наличие админ прав провалена
