Repository: FreezePeace1/UserWebApiTestTask
Catalog: UserWebApi.Application/Sources/SuccessMessages.*.resx
Languages: ru

source: User creation is succeed
ru: Создание пользователя успешно

source: User updating is succeed
ru: Обновление пользователя успешно

source: User updating password is succeed
ru: Обновление пароля пользователя успешно

source: User login updating is succeed
ru: Обновление логина пользователя успешно

source: Getting active users is succeed
ru: Получение активных пользователей успешно

source: Getting user personal data by login is succeed
ru: Получение персональных данных пользователя по логину успешно

source: Getting user by login and password is succeed
ru: Получение пользователя по логину и паролю успешно

source: Getting all users by definite age is succeed
ru: Получение всех пользователей по определенному возрасту успешно

source: Soft deleting is succeed
ru: Мягкое удаление удачно

source: Full deleting is succeed
ru: Полное удаление удачно

source: Recovering user by login is succeed
ru: Восстановление пользователя по логину успешно
